using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SING.Data.DAL.NewCode
{
    public enum ErrorType
    {
        fail = -1,
        success = 0,
        未知业务错误 = 100,
        必填项未空 = 101,
        违反唯一约束 = 102,
        数据格式错误 = 103,
        超出字符限制 = 104,
        数据库错误 = 200,
        服务端请求出错 = 400,
        服务端资源找不到 = 404,
        非法的请求参数 = 1000,
        用户认证失败 = 1001,
        连接抓拍服务异常 = 1002,
        连接比对服务异常 = 1003,
        数据库操作异常 = 1004,
        用户名或密码错误 = 1005,
        操作通道异常 = 2000,
        添加通道失败 = 2001,
        修改通道失败 = 2002,
        删除通道失败 = 2003,
        查询通道失败 = 2004,

        操作模板异常 =3000,
        添加模板失败 = 3001,
        修改模板失败 = 3002,
        删除模板失败 = 3003,
        查询模板失败 = 3004,

        操作模板库异常 =4000,
        添加模板库失败 = 4001,
        修改模板库失败 = 4002,
        删除模板库失败 = 4003,
        查询模板库失败 = 4004,

        操作人脸对象异常 =5000,
        添加人脸对象失败 = 5001,
        修改人脸对象失败 = 5002,
        删除人脸对象失败 = 5003,
        查询人脸对象失败 = 5004,

        操作区域对象异常 =6000,
        添加区域对象失败 = 6001,
        修改区域对象失败 = 6002,
        删除区域对象失败 = 6003,
        查询区域对象失败 = 6004,

        操作布控任务异常 = 7000,
        添加布控任务失败 = 7001,
        修改布控任务失败 = 7002,
        删除布控任务失败 = 7003,
        查询布控任务失败 =7004,

        操作抓拍数据异常 =8000,
        添加抓拍数据失败 =8001,
        修改抓拍数据失败 =8002,
        删除抓拍数据失败 =8003,
        查询抓拍数据失败 =8004,

        操作告警数据异常 =9000,
        添加告警数据失败 =9001,
        修改告警数据失败 =9002,
        删除告警数据失败 =9003,
        查询告警数据失败 =9004,
        操作报警数据异常 =9005,
        添加报警数据失败 =9006,
        修改报警数据失败 =9007,
        删除报警数据失败 =9008,
        //查询抓拍数据失败 =6000,

        操作目标人数据异常 =10000,
        添加目标人数据异常 =10001,
        修改目标人数据异常 =10002,
        删除目标人数据异常 =10003,
        查询目标人数据异常 =10004,

        操作比对策略数据异常 =11000,
        添加比对策略数据异常 =11001,
        修改比对策略数据异常 =11002,
        删除比对策略数据异常 =11003,
        查询比对策略数据异常 = 11004
    }
}
